{
  "children": [
    {"object": "block", "type": "heading_2", "heading_2": {"rich_text": [{"type": "text", "text": {"content": "AD 1: Quality Volume ⭐ TIER 1"}}]}},
    {"object": "block", "type": "paragraph", "paragraph": {"rich_text": [{"type": "text", "text": {"content": "PI ATTORNEYS signing 10+ cases/month:\n\nYou have a lead quality problem disguised as volume.\n\nYour vendor sends 100 MVA leads. Your intake qualifies 15. You sign 5. You blame intake for the 85 that didn't qualify.\n\nBut those 85 were never going to sign. They weren't real injury cases. They weren't high intent. They were clicks, not clients.\n\nHere's the real solution: Stop receiving leads. Start receiving signed cases.\n\nWe fund the marketing. We generate the demand. Our MVA-trained intake team qualifies prospects and closes retainers on your behalf.\n\n~$3,000 average cost per signed case. 87% of partners renew after 90 days.\n\nNo retainers. No setup fees. No ad spend required.\n\nQuality isn't just upstream. It's delivery."}}]}},
    {"object": "block", "type": "callout", "callout": {"rich_text": [{"type": "text", "text": {"content": "PROMPT: Near-black (#1A1A1A) background with subtle data visualization texture. TOP: \"THE MATH YOUR VENDOR DOESN'T SHOW YOU\" in white header. CENTER: Side-by-side calculator displays. LEFT (LEAD MODEL): 100 leads → 15 qualified → 5 signed → CPA $4,000, \"YOU DO THE WORK\" stamp. RIGHT (CLOSED CASE MODEL): 100 prospects → 65 qualified → 25 signed → CPA ~$3,000 in #3399FF, \"WE DO THE WORK\" stamp. BOTTOM: \"Same budget × We close = 5X signed cases\". Financial calculator aesthetic. DO NOT INCLUDE: rounded corners, warm colors, photos, soft gradients, emojis."}}], "icon": {"emoji": "🎨"}}},
    {"object": "block", "type": "divider", "divider": {}},
    {"object": "block", "type": "heading_2", "heading_2": {"rich_text": [{"type": "text", "text": {"content": "AD 2: Intake Defense"}}]}},
    {"object": "block", "type": "paragraph", "paragraph": {"rich_text": [{"type": "text", "text": {"content": "PI ATTORNEYS signing 10+ MVA cases/month:\n\nThey're not dropping the ball. They were handed garbage.\n\nWhen 85% of your \"leads\" are unqualified from the start—wrong injury type, no treatment, liability issues, already retained—no amount of training fixes that.\n\nYour intake team isn't a filter for junk. They're supposed to close real cases.\n\nHere's how to actually fix it: We pre-qualify every prospect before you ever see them. Verified injury. Confirmed liability. Insurance checked.\n\nYour team stops sorting and starts closing.\n\n~$3,000 average cost per signed case. 87% partner retention.\n\nNo retainers. No setup fees. No ad spend required.\n\nStop blaming downstream for upstream problems."}}]}},
    {"object": "block", "type": "callout", "callout": {"rich_text": [{"type": "text", "text": {"content": "PROMPT: Near-black (#1A1A1A) background. TOP: \"YOUR INTAKE ISN'T THE PROBLEM\" with crossed-out funnel icon. CENTER: Intake workers buried by avalanche of \"JUNK LEADS\" papers. Red \"BAD LEADS\" stamp. BOTTOM: Blue process flow \"QUALIFIED DEMAND → MVA-TRAINED TEAM → SIGNED RETAINER → ~$3K PER CASE\". DO NOT INCLUDE: rounded corners, warm colors, photos, emojis."}}], "icon": {"emoji": "🎨"}}},
    {"object": "block", "type": "divider", "divider": {}},
    {"object": "block", "type": "heading_2", "heading_2": {"rich_text": [{"type": "text", "text": {"content": "AD 3: Speed Myth"}}]}},
    {"object": "block", "type": "paragraph", "paragraph": {"rich_text": [{"type": "text", "text": {"content": "FOR PI LAW FIRMS signing 10+ cases/month:\n\nYou can call in 30 seconds. You can have the best intake script. You can follow up seven times. None of it matters if the lead wasn't a real injury case to begin with.\n\nMost PI firms try to solve conversion problems at intake. They hire trainers. They buy dialers. They run reports.\n\nBut they're optimizing the wrong part of the funnel.\n\nHere's the actual fix: stop receiving leads entirely.\n\nWe fund the marketing. Our MVA-trained intake team qualifies and closes retainers. You receive signed cases—not contacts to chase.\n\n~$3,000 average cost per signed case. 87% of partners renew.\n\nNo retainers. No setup fees. No ad spend required.\n\nStop optimizing intake. Start receiving signed cases."}}]}},
    {"object": "block", "type": "callout", "callout": {"rich_text": [{"type": "text", "text": {"content": "PROMPT: Near-black (#1A1A1A) background. TOP: \"SPEED WON'T FIX BAD LEADS\" with crossed-out speedometer in red. CENTER: Funnel with debris labeled \"UNQUALIFIED LEADS\". Red X callouts: \"Faster dialer\", \"Better scripts\", \"More follow-ups\". Red \"ELIMINATED\" stamp. BOTTOM: Blue flow \"HIGH-INTENT → WE CLOSE → SIGNED RETAINER → ~$3K\". DO NOT INCLUDE: rounded corners, warm colors, photos, emojis."}}], "icon": {"emoji": "🎨"}}}
  ]
}
